{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "facebook/esm2_t6_8M_UR50D",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "esm.encoder.layer.2.attention.self.query",
    "esm.encoder.layer.1.attention.self.query",
    "esm.encoder.layer.4.attention.self.query",
    "esm.encoder.layer.0.attention.self.value",
    "esm.encoder.layer.2.attention.self.key",
    "esm.encoder.layer.0.attention.self.key",
    "esm.encoder.layer.1.attention.self.key",
    "esm.encoder.layer.4.attention.self.key",
    "esm.encoder.layer.5.attention.self.key",
    "esm.encoder.layer.5.attention.self.value",
    "esm.encoder.layer.0.attention.self.query",
    "esm.encoder.layer.3.attention.self.key",
    "esm.encoder.layer.4.attention.self.value",
    "esm.encoder.layer.3.attention.self.query",
    "esm.encoder.layer.5.attention.self.query",
    "esm.encoder.layer.1.attention.self.value",
    "esm.encoder.layer.3.attention.self.value",
    "esm.encoder.layer.2.attention.self.value"
  ],
  "task_type": "SEQ_CLS",
  "use_dora": false,
  "use_rslora": false
}